/**
 * 溢出
 *
 *
 * */

var uint8 = new Uint8Array(1);

uint8[0] = 259; //100000011
console.log(uint8[0]); // 3  (因為有 9 位，第 9 位直接捨去)

uint8[0] = -3; //負數在電腦中是採用二補數格式: 11111101
console.log(uint8[0]); // 因為 Uint8Array 為無符號，因此 11111101 會被視為正數，所以為 253

let int8 = new Int8Array(1);

int8[0] = 259; //100000011
console.log(int8[0]); //3  (因為有 9 位，第 9 位直接捨去)

int8[0] = 128; //10000000  (因為是 Int8Array，所以 1 開頭代表負數，所以此時 10000000 代表 -128)

console.log(int8[0]); //-128

int8[0] = -129; //01111111  (因為是 Int8Array，所以 0 開頭代表正數，此時 01111111 代表 127)
int8[0]; // 127

// int8[0] = -1; //負數在電腦中是採用二補數格式: 11111111
// console.log(int8[0]); // 因為 Int8Array 為有符號，因此 11111111 會被視為負數的二補數 ，所以為 -1
